Revit 2024 API
SunAndShadowSettings.UsesGroundPlane Property
 Identifies whether the SunAndShadowSettings element uses a ground plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool UsesGroundPlane { get; set; }
Visual Basic
Public Property UsesGroundPlane As Boolean
	Get
	Set
Visual C++
public:
property bool UsesGroundPlane {
	bool get ();
	void set (bool value);
}
See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace